# text_constants.py

PLEASE_VERIFY_NUMBER = "Для подтверждения личность нажмите `Отправить мой номер`"
TIMEOUT_MESSAGE = (
    "Время ожидания кода истекло. Пожалуйста, отправьте команду /start заново."
)
CODE_SENT_MESSAGE = (
    "Код подтверждения отправлен. Пожалуйста, введите его в течение 1 минуты."
)
INVALID_CODE_MESSAGE = "Ошибка: неверный код. Попробуйте ещё раз."

LOANS_MENU_TEXT = "💳 Залоги и оплата"

PAYLOAN_SELECTION_MESSAGE = "Вы выбрали оплату долга {loan_id}. Пока оплата недоступна."

NO_ACTIVE_LOANS = "❌ У клиента нет активных залогов."
PAWN_TICKET_HEADER = "📜 Выберите залоговый билет:"

INVALID_PHONE_MESSAGE = (
    "Ошибка: введите корректный номер телефона в формате +79991234567 или 89991234567."
)

PAY_LOAN_BUTTON = "✅ Оплатить проценты"
CLIENT_NOT_FOUND = "Клиент с таким номером телефона не найден. Пожалуйста, отправьте команду /start заново."
SEND_MY_CONTACT_BUTTON = "Отправить мой номер"
START_COMMAND_DESCRIPTION = "Отправить /start"
AUTH_SUCCESS = "Здравствуйте, {full_name}!\n"

RUB = "₽"
