# text_constants.py

START_MESSAGE = "Введите номер телефона клиента ломбарда. Для подтверждения личности вам придёт смс с кодом."
TIMEOUT_MESSAGE = "Время ожидания кода истекло. Пожалуйста, отправьте команду /start заново."
CODE_SENT_MESSAGE = "Код подтверждения отправлен. Пожалуйста, введите его в течение 1 минуты."
REGISTRATION_SUCCESS_MESSAGE = "Регистрация успешно завершена!"
INVALID_CODE_MESSAGE = "Ошибка: неверный код. Попробуйте ещё раз."

DEBT_MENU_TEXT = "💰 Общая информация"
LOANS_MENU_TEXT = "💳 Залоги и оплата"

PAYLOAN_SELECTION_MESSAGE = "✅ Вы выбрали оплату долга {loan_id}. Пока оплата недоступна."

DEBT_INFO_HEADER = "💰 Полный долг:"
INTEREST_DEBT_HEADER = "💸 Проценты:"
OVERDUE_DEBT_HEADER = "⏳ Просроченный долг:"
OVERDUE_INTEREST_DEBT_HEADER = "📉 Просроченные проценты:"
NEAREST_PAYMENT_HEADER = "📅 Ближайшая дата платежа:"

NO_ACTIVE_LOANS = "❌ У клиента нет активных залогов."
PAWN_TICKET_HEADER = "📜 Залоговые билеты:"

INVALID_PHONE_MESSAGE = "Ошибка: введите корректный номер телефона в формате +79991234567 или 89991234567."
